using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Random_String_Generator
{
    public class Character
    {
        public string single_string_option(int num_type)
        {
            //return a string based on the option 
            string return_str;
            switch (num_type)
            {
                case 1:
                    return_str = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
                    break;
                case 2:
                    return_str = "abcdefghjkmnpqrstuvwxyzilo";
                    break;
                case 3:
                    return_str = "0123456789";
                    break;
                case 4:
                    return_str = "~!@#$%^&*()_+{}|:”<>?`-=[]\\;’,./ ";
                    break;
                case 5:
                    return_str = "一力丈凡卫无尤冈仆乏方队打丙旧只代乐闪必边寺共在轨吐岂乒仿企争充汤访如驰技抓扭劳豆呈困钉作返犹床灶完诉际纱青拍坡茄丧态些易岭和货斧肥京闸河治帘详限终持指草相厚临昨哗钢秋俗剑狠迹养剃洲突垦姻绘顽捆恭格础虑唤氧笑健颂恋离粉涉悄诸剥预掉基梢辅啄银偶欲馆族淹悼逮绳超握朝惑辉跌铸稍牌禽善湾窝隙搏幕感睛遣辞遥数滨缝蔽需箩膏滴慧槽踩僵懂嘴辩霞覆嚼匕叽夷妆韧芯吟甸沥玫苛殴贮肮沼姆挟栈盹钮峦恍骇耿酌蚓秫逛浦恕掖菇彪啰铣舷眷涵堕揩椰凿啼粤遂谤聘碘蜈稚馏窟蔓雌孵嫡敷嘿潭履瓢篡缰蟋懦蘑鳞乙乃与及也元友贝化公火办巧左帅央仙句兰议发吉芒有邪吓刚乓伙众色妄忙寻妇巡坏扮块克两时吵告伯余角库灿宋诊陆纳责者披茎或欧虎昂凯季依爸服享闹沾怖实建妹驻项垫茧查砌览畏咱钥科俘逃贸庭美洁浑穿退娇给盏捐莲校破监啊特笋臭翁桨唐料消悔读恳桑堆著梅辆距甜偷彩凑旋渠惧敢维提揉辜逼敞跑铺程堡腊羡渡窗絮塌蓬碍睡蛾稠腰煎粱缠慕弊管遮演撕樱踪躺额蹄糖瞧蹦嚷刁皿吁亥抠芭呛狈沦卦苫歧氛肪怔虱垢柑咧毡奕恬耘聂砸哩笆卿涡娩掷彬眶唾铭舵焊惦隅揽焚棠喧逾焙犀斟硼蜗颓禀寝蔗墅瘩缨豌幢潦嬉蟥篷壕蟀豁藻糯二刀万夕女专匹内仇仓为以正厉归兄们匆半讯孕扣亚百划虫则休伪爷壮闭兴那好寿扰抢声苏丽吴串我伶希删疗弟宏词阿纲现顶拨茅画垄虏典败委的采胁店郑泪性试肃姑驼垮挣茶柏砍竖趴响钩重信食怨疮姜洪浓窃既怒络匪损莫核原紧唉牺债射脆浆资益浩悦扇展绢推勒检虚跃梨您领减望渐惕屠绵堤斯葵厨赏遗链稀集脾普游遍嫂鼓蓄碑睬蜂愁腥塑滩静暮裳僚腐漏撒橡蝶僻慰器糕蹈镰籍丐凹吕汛扼杖吻鸠汹坷苟卓秉狞怯叁垛栅昵氢咨恤耙荸砰圃俺鸵涣骏掸梗晤啤矫敛焕悴婉揖椎晰嵌腌滞隘靴碉蜕筷痹褂蔼嘁瘟撵醇镊澳豫霍篙藐嚎臀鳖譬十又上丸飞云车水币月斗允扑右且叼仪册汁记圣考芝存迈曲肉伍自伞冲问宇迅她弄拒孝把杆医助员乱佣坐条应汪牢译陈驳表拆择林卧妻肾固贩佳迫受周夜券油怕郎录姐绍挎挤荒柳面省胃哈卸复皇盆急疯叛洒津客屋架骆捞都荷样套党罢造借躬脂衰凉兼海害袜剧绣掀黄梳雀略犁售脚毫率混惊弹绸博期棒厦掌蛙销税焦腔粪滋裕登摆蒙碎鄙嗓筹腹慈慎碧蔑颗鼻瘦慢趣飘蝴德劈赠燃螺翻魔歹囚吆讳汞杉吭彤沧坯苞昙岳庞宠绅拯柠昭秕飒宦秦莽砾鸯赁鸳涤琐掺梧曼啥秸翎鸿惋颇彭棺鼎赋腋湘媒靶辐蛹魁廓裸熙踊彰撩磕镐潘缭霎篱檬赡藕蹭霹丁三小么刃扎巨见仍氏忆予扒石旦叫白犯汇永对托朽而毕团网伏血创冰闯守尽妈麦找均报杠辰县听利低谷卵冷沙究君阻纵规拥抬枝事轰贤忠购侍质乳昏庙卷泊怜诗隶姓经城拼茫柱耐削贵咬缸竿泉胆饶疫送浇恒冠昼贺绝栽哲获根逐晒峰乘值息胸高站烤涂宽袖屑验授萌梯堂蛇移停脖麻着渔惨随绿揭欺棋硬晴蛛锁筐傍鲁尊溉裤缎携蒸碰愚置签腾煤誉璃模嗽魄辣寨趟醋嘱艘操默澡穗鹰灌戈矢屹讶扳巫邑灸沪拓茁哎侠疟宛驹荆枷盅俏闺诫匿莱殉唁倔馁涧麸勘梭晦啸秽脯涯寂绰揣榔喳赎腕渤媚蓖辑嗅衙痴谬蔚蝉粹撮磅稽澈撼辙儒檐镣藤蹬躏厂于口广习艺牙午仅勿订劝功布目另仔外头司台老朴页至同年优向肌庄羊宅导戏形批抛却杜励里吩秃你妥岛这汽穷灵附纷抹抵其杯刺顷尚咐图供欣贪鱼府单沿怪肩居始贯挠挖荡柿耍尝界咳拜段鬼胜蚀疤类浊恢语费盈绞捕逝晋索烈眠圆敌倚徒胳席剖烘浴家袍弱继教萝桶常累笨偏脸痒盖淘惯蛋琴喜联植确暑蜓锄等储猾道愤裙缓搬献碗暖罪简腿煌塞墙榴蜻貌竭赛撑醉墨膝燕镜激繁警蠢夭乍廷讹抡杈囤刨忱坪苔咕侥疙衩绊茸勃勋俄闽诬埂莉逞哼殷凌涕琉聊曹冕崎笙逸淑窒绷搀椭遏赐猩渺婿蒿频嗡腻靖媳兢嘀漱撬碾篓澜擂冀膳檩魏瞻簸髓七干巾亡叉木屯牛斤欠计双扔龙叶叨他处汉尼矛执机匠此吊朱伐似朵庆并字异羽进扯投劫材否呆吹秀住含迎序沃灾即妙纸拢拘取柜枣转旺呼钓使征念兔底炒泡学房届驾奏政按荣栏牵是虹哪看便侵胞饺姿迷洞恰扁陡勇统振捡恶哥殊晓贼秤倾徐脏准竞烦浮宵被陵球掏菌救匙唱笼假脱痕粘液寇隆斑插散森雁最喝锅筑奥猴曾慌谢编摇禁碌盟罩毁触满谨撇榜蜡膜端察播震镇膛薯赞懒辫攀霸仑尔迄讼坎甫吮庇诅坤枉呵侣疚祈绎茬柬哆俐籽祠捂莹哮唆耸凄涩琅娶酝啡逻笤凰淌谍综搓粟晾锉猬溃缅蒲睹嗤腮誊嫉榛幔漩擒憋膘澄擅踱鲸檀簇嚣簿蘸卜亏山门马五比手爪风户书去平甲叹斥冬宁民纠巩权夸贞吃先延后杂亦关安孙观戒址坟芽村还园呜私位邻饭辛泛良层妖纹拔势苦析雨斩具鸣制例往贫狐剂炊注宝诚刷参春赴挥故树残盼虾炭矩俩追胖饼亲前测恼袄眉怠耕载换真速顾鸭贿租倒舰胶座部烧流宴祥陶理掠菜副晨患笛得象廊粗淡寄隐替揪惹椅殖量喂锈策街然焰惰谣骗搞楚雷歇错舅解漠福嘉榨蝇膊旗蜜撞霉靠熟薪篮壁赢蹲露讥冯臼诀坞匣岖吝诈拄枢咙侈卒诡契荚砂咪侯娄诲捍莺唠峭舀衷悍措菱酗畦崔偎猖淮谐绽壹棘畴锌惫溅缆蓉睦署腺漓缚榕镀漾墩嘶鲤憔蕾蹂瘾礁儡鳍蟹镶人士千义乡支互毛反丹认幻甘灭申四瓜鸟穴出母圾过夺师因丢件行危刘米讲阵欢吞走抗花杏歼旷吧每伴岔饮弃沟证尿妨纺拣抱若板卖轮果咏知版爬肤忽郊炕泻宗衬屈艰帮赵挪胡要殃眨蚁峡怎贷俊脉弯音首洗恨祖孩柔耗赶挽框逗轿晃钱积倘舱脑脊旁烛润宾课陷捧培萄票睁唯符衔够康粒深宿婚款搜葬椒裂喷喘锋筛惩馋港愧谦缘塘想零暗锡鼠酱源群摧歌蜘膀精谱撤瞒稻摩薄邀避糟颤囊冗玄仲弛抑轩牡庐罕拧枚呻卑氓帚贰茵泵哟徊烁屏袁梆哺唧豺郭悯捺菲厢趾崩傀祭淆裆缀搔酣跋甥敦湃缔楔瞄蜀鹏溢缤酵舔慷撰嘲鲫懊薛蟆瘸磷徽癞靡瓤入工乞之丰厅切气介匀心玉世轧叮生乎务它辽幼扩臣灰尘吸舌任舟旬齐灯军阳买远抄坑芹极来围吼兵身肝系冶没启尾努驴担垃茂松矿软味呢垂侄彼肺狗废炎泳定衫弦线珍挡某南咸轻哄思罚牲顺盾勉将帝逆活举神除垒艳起热桂栗较晌钳秧俱般狸症旅烟浪窄谁陪堵接菊戚眯崖第盘猜庸断婆窑婶堪煮葛棵雄晶喉锐筒御装湖愉属瑞摊槐雾照锣催痰滤殿截遭赚鲜歉嫩增题黎颜颠衡缴糠瓣罐邓邦伦阱拟卤佑闰屁拂枫咒刽炬屉玷茴砚幽衍炫屎捌栖剔峻豹斋窍捶萎硅啃婴躯烹渊袱巢葫酥跛掰痘愕缕椿嗜幌肄溯剿碟熏寡鞍嘹褒憎薇螃糙瞭爵瀑癣矗八土川尸王不瓦升父乌尺刊古东电失丛包讨奶丝扫再达尖吗竹伤全旨交州许收红违坝坊芬李连呀别估皂肚言忘沈评迟忍纽坦拉苹枪码到昆岸牧侦径肢备净炉泥宜视承练玻挺甚药威鸦显蚂贱选修待狭奖施总派觉祝险绑泰盐恐档配顿晕钻秩倡航狼病畜递浸容调娱描控萍爽眼崭敏船猪鹿剪梁密颈搭援董棍暂喇幅短答循蛮渣慨屡魂蒜榆雹跨锤傻廉滥辟誓酷锹疑熄翠聪暴稿毅橘膨戴燥爆艾迂伊驮抒肖佃兑坠拙杭咆刹沽弧玲荞鸥钙胚洼逊挫桦蚌赂颁疹诺赦菩硕蛆赊兜庶淫祷琳募硝蛔氮痢惶骚楷嗦锚猿溶赘碴箍寥蕊蝠瘪翩擎螟燎瞬朦襟羹九才亿弓井太止长从凤引示节卡号禾令饥写奴式地协列劣屿迁价会负次汗论阶纤运贡抖苍杨步吨岗体佛肠冻闲沉补局劲奉押拦苗构厕非国岩物侧所肿饰盲沫沸审话孟组毒括革标歪皆哑虽贴适保律狮哀闻炼洽宣误院绒珠捎壶桐翅毙蚊铁称候途逢疾阅涛涨宰冤娘域探菠聋悬崇做斜猎盗兽渗谋绩塔裁葡棉雅遇帽智筋艇就湿割强肆勤楼输跳锦像新滔障境酿锻馒熔熊鞋瞎稼糊整雕擦臂疆夯邢肋驯芙吱伺灼妓拇郁咖肴沮弥珊荠轴钝胧柒陨挚栓蚜赃胯紊诽埠萤奢蚯铐衅庵淳谒琢蒋硫蜒氯痪寓瑟榄暇锥颖滓熬碱箕谭蕴蝎瘤褥翰噪濒瞳臊璧鬓几寸个己开犬少仁今勾丑末本北田丘用主让加刑扬西死光帆乔份杀各衣污农阴级扶攻护芳求坚足帐何近龟状间怀初改鸡玩抽拌英杰奔叔昌帖乖凭舍胀饱放浅波宙诞孤细型拴荐枯研背冒品骨秒促很独亭阀炸染室诱娃结班捏挨株辱致哨铃秘俯拿留疼羞浙烫案谅通掩据营袭野圈袋盒猫章清情谎绪越搁敬棚辈喊赌毯筝舒痛温寒粥摄鹊概督跪键躲韵溪嫌摘酸舞裹漆凳蕉影箱遵融磨鞠翼壤凸芋旭纫芜吠囱沐姊拗矾帕觅泣陋拭荤韭钠胎涎姚捣桅畔钾胰瓷袒捻乾盔蛉铛徘痊淤谓琼蒂颊蛤黍竣窖鹉楞畸锨煞溺赫碳箫褐樊蝌瘫谴噩鹦憾瞪鳄戳攘儿下勺已夫区日什凶文巴未术占由付甩市礼召动场压成当岁伟华合名产江讽防约抚赤壳严更旱邮财但彻免亩闷忧社张驱环拐幸范述奇肯畅罗刮侨金朋饲刻法泼官询陕驶挂拾巷柄砖战映咽钞香侮须狡亮阁炮济宫说姥绕素埋耻桥唇柴哭铅透倍爹皱疲瓶涝涌请谈能捷掘械盛啦铜悠鸽猛竟添惜祸续趁搂葱棕悲景赔鹅傲番童渴富疏摸蓝赖龄路锯微意溜嫁摔磁稳敲漂骡蔬踢箭潜醒凝藏骤耀卢芍匈玖苇呕肛沛妒茉奈账忿泞陌拷荧虐钦狰洛娜捅桩蚣铆脐羔谆掐萧匾蛀铝徙阎淀谚揍韩雳鹃筏翔窘瑰楣跷锭雏寞蔫辕舆褪樟蝗凛鹤橱黔懈曙糜攒蠕了大久子天历中片分六孔击可业史仗印立训皮扛耳厌夹早回传仰兆多决池设奸纪坛折志芦束盯男针伸役狂况判快识忌纯武拖招直枕奋齿明帜秆佩命股变育泄泽空该降织封挑带栋厘点星骂钟种俭叙狱度差烂洋宪诵姨骄蚕捉耽桃夏桌恩缺笔倦爱饿效拳酒悟朗谊难排职梦雪晚铲偿悉馅商淋惭谜骑趋搅落惠紫践黑剩傅释阔滑窜隔填墓酬鉴跟矮愈粮滚叠聚愿算豪漫缩横踏篇潮餐辨霜鞭躁叭吏凫玛芥呐肘汰纬昔奄贬瓮泌函拱荔昧钧饵恃蚤埃贾蚪氨脓烙祟掂萨颅唬铡舶阐涮尉堰棱翘喻牍奠雇搪酪跺锰馍窥摹辖僧隧橄蝙澎憨橙穆窿蹋癌孽巍";
                    break;
                case 6:
                    return_str = "~！@#￥%……&*（）——+{}|：“《》？·-=【】、；‘，。/";
                    break;
                case 7:
                    //Exclude I, O
                    return_str = "ABCDEFGHJKLMNPQRSTUVWXYZ";
                    break;
                case 8:
                    //Exclude i, l, o
                    return_str = "abcdefghjkmnpqrstuvwxyz";
                    break;
                case 9:
                    //Exclude 0, 1
                    return_str = "23456789";
                    break;
                default:
                    return_str = "";
                    break;
            }
            return return_str;
        }

        public string all_string_option(List<int> options )
        {
            string charset = "";
            foreach(var option in options)
            {
                charset += single_string_option(option);
            }
            return charset;
        }
    }
}